HopeFOAM-0.1/tutorials/lagrangian/sprayFoam/aachenBomb/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0.766;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
